import folium
from folium.plugins import FloatImage, Fullscreen


#Ο παρακατω κοδικας βαζει ορια για να μην  διαφευγει ο Χαρτης απο την Ελλάδα.
min_lon, max_lon = 19, 32#Ορισμος γεωγραφικου μηκους (δυση)(ανατολη)
min_lat, max_lat = 34, 43#Ορισμός γεωγραφικου πλάτους (βοράς)(νότος)

map = folium.Map(max_bounds=True,#θετει αυτα τα ορια ως τα όρια του χαρτη,δεν μπορει δηλαδή να ξεφυγει απο αυτα τα όρια
                 location=[38.5, 23.7],#Αυτο ειναι το κεντρικο σημειο του χάρτη
                 zoom_start=6,#Δηλωνει την εστίαση (ζουμ)
                 min_lat=min_lat,#Αυτά οριζουν τα γεωγραφικά όρια
                 max_lat=max_lat,
                 min_lon=min_lon,
                 max_lon=max_lon)



#Με την CircleMarker την χρησημοποιουμε για να προσθεσουμε ενα κυκλικο marker το πρωτο ορισμα μεσα σε αυτην δεχεται
# της συντεταγμενες, ενω με το δευτερο χρησιμοποιειται οταν το ποντικι παω πανω στο κυκλικο marker να μας εμφανησει
# το σημειο που βρισκεται και στο τελος με την μεθοδο .add_to() το αποθηκευουμε στον χαρτη μας.
folium.CircleMarker([max_lat, min_lon], tooltip="Upper Left Corner").add_to(map)
folium.CircleMarker([min_lat, min_lon], tooltip="Lower Left Corner").add_to(map)
folium.CircleMarker([min_lat, max_lon], tooltip="Lower Right Corner").add_to(map)
folium.CircleMarker([max_lat, max_lon], tooltip="Upper Right Corner").add_to(map)






#Συντενταγμένες για διάφορες πόλεις της Ελλάδος
cities_greece = {
    'Αθήνα': [37.983917, 23.729336],
    'Θεσσαλονίκη': [40.640063, 22.944419],
    'Πάτρα': [38.24664, 21.734574],
    'Ηράκλειο': [35.3387, 25.1442],
    'Λάρισα': [39.639022, 22.419125],
    'Βόλος': [39.36219, 22.942159],
    'Ιωάννινα': [39.665029, 20.853747],
    'Τρίκαλα': [39.55502, 21.76598],
    'Χαλκίδα': [38.46246, 23.59408],
    'Σέρρες': [41.09074, 23.54919],
    'Αλεξανδρούπολη': [40.84563, 25.87658],
    'Ξάνθη': [41.13788, 24.88669],
    'Κατερίνη': [40.27089, 22.50961],
    'Αγρίνιο': [38.62519, 21.40823],
    'Καλαμάτα': [37.03819, 22.11205],
    'Καβάλα': [40.93681, 24.41282],
    'Χανιά': [35.51156, 24.01955],
    'Λαμία': [38.89918, 22.43408],
    'Κομοτηνή': [41.11814, 25.40374],
    'Ρόδος': [36.44256, 28.22594],
    'Δράμα': [41.14962, 24.14589],
    'Βέροια': [40.5159, 22.20062],
    'Κοζάνη': [40.29216, 21.79688],
    'Καρδίτσα': [39.36616, 21.92528],
    'Ρέθυμνο': [35.36669, 24.47479],
    'Πτολεμαϊδα':[40.51486, 21.68289],
    'Τρίπολη': [37.51083, 22.37366],
    'Κόρινθος': [37.93555, 22.92572],
    'Μυτιλήνη': [39.10556, 26.55602],
    'Χιός': [38.37275, 26.13304],
    'Κέρκυρα': [39.62169, 19.91684],
    'Πυργος': [37.67081, 21.44257],
    'Κιλκίς': [40.99415, 22.87388],
    'Άρτα': [39.16145, 20.98663],
    'Λιβαδεία': [38.4387, 22.8754],
    'Πρέβεζα': [38.95622, 20.74768],
    'Σπάρτη': [37.0747, 22.42996],
    'Έδεσσα': [40.80105, 22.0499],
    'Φλώρινα': [40.78275, 21.41287],
    'Ναύπλιο': [37.56636, 22.80762],
    'Καστορία': [40.52128, 21.26541],
    'Γρεβενά': [40.08425, 21.42763],
    'Άγιος Νικόλαος': [35.1901, 25.7162],
    'Ερμούπολη': [37.45, 24.9],
    'Αργοστόλι': [38.17568, 20.48744]

}



folium.plugins.Fullscreen(position='topright', title='Full Screene', title_cancel='Exit', force_separate_button=True).add_to(map)  #Βαζει την επιλογη για full screene



url = (
    "https://raw.githubusercontent.com/ocefpaf/secoora_assets_map/"
    "a250729bbcf2ddd12f46912d36c33f7539131bec/secoora_icons/rose.png"
)
FloatImage(url, bottom=0, left=0).add_to(map) # Προσθετει μια πιξιδα στον χαρτη κατω αριστερα




try:                                                #Προσθετει marker για καθε μια πολη μαζι με το ονομα της .
    for city, location in cities_greece.items():
      folium.Marker(location=location, tooltip='Click to see the weather', popup=city, icon=folium.Icon(icon="cloud")).add_to(map)
except Exception as e:
    print(f'Σφαλμα: {e}')


try:
  map.save("map.html") #Αποθηκευει σε ενα αρχειο τον Χαρτη
except Exception as e:
   print('Σφαλμα: {}'.format(e))

